In [23]:
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [24]:
df = pd.read_excel('mock_dataset.xlsx')
df

,id,product,price,brand_model,discount,Amazon,Flipkart,rating,stock,seller_city,warranty
0,1,keyboard,Rs.70000,dell-d11,flat ten,0,1,3.8,Y,Noida,OneYr
1,2,mobile,80k,logitech K120,none,0,1,NaN,0,pune,NaN
2,3,headphone,100$,classmate,flat ten,1,0,4.5,1,Bangalore,1 year
3,4,accessories,"rs1,299",dell-d11,NaN,1,0,3,Y,Delhi,OneYr
4,5,books,899rs/-,classmate,NaN,0,0,4.5,1,Noida,OneYr
...,...,...,...,...,...,...,...,...,...,...,...
995,996,keyboard,80k,Samsung S-12,none,1,1,four,YES,pune,OneYr
996,997,tablet,80k,boAT-B19,upto 30%,1,1,five,yes,Hyderabad,12 months
997,998,tablet,100$,lenovo L11,none,0,0,3.8,YES,Bangalore,12 months
998,999,books,500rs+50$,classmate,flat ten,0,1,3,Y,mumbai,NaN
999,1000,tablet,50$,logitech K120,flat 15%,0,1,five,1,Noida,NaN

In [25]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 11 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   id           1000 non-null   int64
 1   product      1000 non-null   object
 2   price        1000 non-null   object
 3   brand_model  893 non-null    object
 4   discount     881 non-null    object
 5   Amazon       1000 non-null   int64
 6   Flipkart     1000 non-null   int64
 7   rating       868 non-null    object
 8   stock        1000 non-null   object
 9   seller_city  1000 non-null   object
 10  warranty     683 non-null    object
dtypes: int64(3), object(8)
memory usage: 86.1+ KB

In [26]:
for i in df.columns[[3,4,10]]:
    df[i] = df[i].fillna('Unknown')

In [27]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 11 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   id           1000 non-null   int64
 1   product      1000 non-null   object
 2   price        1000 non-null   object
 3   brand_model  1000 non-null   object
 4   discount     1000 non-null   object
 5   Amazon       1000 non-null   int64
 6   Flipkart     1000 non-null   int64
 7   rating       868 non-null    object
 8   stock        1000 non-null   object
 9   seller_city  1000 non-null   object
 10  warranty     1000 non-null   object
dtypes: int64(3), object(8)
memory usage: 86.1+ KB

In [28]:
df['rating'].unique()

array([3.8, nan, 4.5, 3, 'five', 'four', 5, 4.2], dtype=object)

In [29]:
df['rating'] = df['rating'].replace({'five':5, 'four':4})

In [30]:
df['rating'].astype('float64')

0      3.8
1      NaN
2      4.5
3      3.0
4      4.5
      ...
995    4.0
996    5.0
997    3.8
998    3.0
999    5.0
Name: rating, Length: 1000, dtype: float64

In [31]:
# sns.boxplot(x=df['rating'])

In [32]:
df['rating']=(df['rating'].fillna(df['rating'].mean())).round(1)